In [29]:
#Niketan Baranwal
#NetID: nkb59
#RUDI: 177008211

In [ ]:
import pandas as pd 
import numpy as np

In [30]:
from sklearn.model_selection import train_test_split 
from sklearn.linear_model import LogisticRegression
from sklearn.metrics import accuracy_score
from sklearn.preprocessing import LabelEncoder, StandardScaler
from sklearn.impute import SimpleImputer

In [31]:
titanic_data = pd.read_csv("/Users/niketanbaranwal/Downloads/Titanic-Dataset.csv")

In [32]:
#get a glimpse of the dataset that we are working with and what types of categorical and numerical attributes exist
titanic_data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [33]:
#helps us see where most of the data is missing from: age, cabin, embarked
titanic_data.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [34]:
titanic_data.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [35]:
titanic_data.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [36]:
#numerical colums are ['PassengerId','Survived','Pclass','Age','SibSp','Parch','Fare']

In [37]:
#categorical columns are ['Name', 'Sex', 'Ticket', 'Cabin','Embarked']

In [38]:
#drop cabin column, so many missing values can make imputation difficult plus imputing such a large number of data can cause bias
titanic_data = titanic_data.drop('Cabin',axis=1)

In [39]:
#median imputation since age is a numerical attribute
imputer_age = SimpleImputer(strategy = 'median')
titanic_data['Age'] = imputer_age.fit_transform(titanic_data[['Age']])

In [40]:
#mode imputation since embarked is a catergorical attribute
imputer_embarked = SimpleImputer(strategy='most_frequent')
titanic_data['Embarked'] = imputer_embarked.fit_transform(titanic_data[['Embarked']])[:,0]

In [41]:
#one hot encode categorical features: changes categorical values into numerical values (0 or 1) and reduces redundancy/avoids multicollinearity 
titanic_data = pd.get_dummies(titanic_data,columns = ['Sex','Embarked'], drop_first = True)

In [42]:
#drop unnecessary columns since we are trying to predict survivability, these columns do not matter to us
titanic_data = titanic_data.drop(['PassengerId', 'Name' ,'Ticket'], axis = 1)

In [43]:
X = titanic_data.drop('Survived',axis = 1)
y = titanic_data['Survived']

In [44]:
titanic_data.head()

,Survived,Pclass,Age,SibSp,Parch,Fare,Sex_male,Embarked_Q,Embarked_S
0,0,3,22.0,1,0,7.2500,True,False,True
1,1,1,38.0,1,0,71.2833,False,False,False
2,1,3,26.0,0,0,7.9250,False,False,True
3,1,1,35.0,1,0,53.1000,False,False,True
4,0,3,35.0,0,0,8.0500,True,False,True

In [45]:
titanic_data.isnull().sum()

Survived      0
Pclass        0
Age           0
SibSp         0
Parch         0
Fare          0
Sex_male      0
Embarked_Q    0
Embarked_S    0
dtype: int64

In [46]:
scaler = StandardScaler()
numerical_cols = ['Pclass','Age','SibSp','Parch','Fare']
X[numerical_cols] = scaler.fit_transform(X[numerical_cols])

In [47]:
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.2, random_state=50)

In [48]:
#
linear_model = LogisticRegression(max_iter=1000)
linear_model.fit(X_train,y_train)
y_pred_linear = linear_model.predict(X_test)
linear_accuracy = accuracy_score(y_test, y_pred_linear)
print(f"Linear Model Accuracy: {linear_accuracy}")

Linear Model Accuracy: 0.8044692737430168